# config/settings.py

# كادر الكشف الشامل والنهائي لـ YOLO11 
# زودنا الارتفاع والعرض عشان يجيب الجيوب الستة كاملة بالجلد والخشب بتاعها ومن غير ما يقطع الجيوب اللي تحت
TABLE_ROI = {
    "top": 274,         # من بداية الحافة العلوية
    "left": 40,        # من أقصى الشمال
    "width": 1566,      # العرض الكامل عشان يلقط الجيوب اليمين لآخرها
    "height": 820       # الارتفاع المظبوط عشان ينزل يجيب قعر الجيوب اللي تحت كاملة
}

# الحدود الهندسية الصافية لارتداد الكور (منطقة اللعب الداخلي - القماش الأزرق بالظبط)
# دي اللي الحسابات الفيزيائية للموديل بترتد منها عشان الخطوط م تطلعش برة الطاولة
PLAYABLE_CUSHIONS = {
    "top": 236,
    "bottom": 824,
    "left": 172,
    "right": 1748
}

# نصف القطر الظاهري المظبوط للكور على الشاشة
BALL_RADIUS = 15  

# اختصارات لوحة المفاتيح المتفق عليها (Hotkeys)
HOTKEYS = {
    "CALIBRATE": "t",       # زرار المعايرة اليدوية (سحب المستطيل الشفاف)
    "TARGET_LOCK": "z",     # قفل الهدف على الكورة القريبة من الماوس
    "POCKET_1": "1",        # اختيار الجيب العلوي الشمال
    "POCKET_2": "2",        # اختيار الجيب العلوي الوسط
    "POCKET_3": "3",        # اختيار الجيب العلوي اليمين
    "POCKET_4": "4",        # اختيار الجيب السفل الشمال
    "POCKET_5": "5",        # اختيار الجيب السفلي الوسط
    "POCKET_6": "6",        # اختيار الجيب السفلي اليمين
    "AUTO_BANK": "s",       # تشغيل حسابات ضربة البند (Bank Shot)
    "COMBO_SHOT": "o",      # تشغيل حسابات الضربة المزدوجة (Combo)
}

# إعدادات الفيزكس المتقدمة ومعامل الارتداد حسب قوة الضربة
CUSHION_ELASTICITY = 0.85
POWER_MODES = {
    "SOFT": {"elasticity": 0.88, "angle_compression": 1.0},
    "MEDIUM": {"elasticity": 0.85, "angle_compression": 0.98},
    "HARD": {"elasticity": 0.80, "angle_compression": 0.92}
}
